[
  {
    "name": "Sarah",
    "position": "Customer Success Manager",
    "recommendation": "I've worked with Laurens in my role at commercetools and have found him to be one of the most professional and hard working people I've met in my career. He definitely stood out as an excellent communicator internally, and with clients, as well as a talented engineer. He is incredibly easy to work with and very reliable. Clients trust and find him a strong pair of hands for any technical problem solving, no matter the complexity. He's also very thorough, and clients would ask for his specific feedback consistently."
  },
  {
    "name": "Sven",
    "position": "Senior Fullstack Developer",
    "recommendation": "The attention to detail that has shown in your work has always impressed me. I think that careful work and well-thought-out results are a superpower that you definitely possess. "
  },
  {
    "name": "Subham",
    "position": "Customer Success Engineer",
    "recommendation": "One of Laurens' standout qualities is his empathy for customers. He consistently goes the extra mile to understand their unique challenges, ensuring that solutions are tailored to meet their specific needs. His ability to communicate complex technical ideas clearly and concisely, both through well-crafted documentation and in person, fosters strong relationships and trust with clients."
  },
  {
    "name": "Enrico",
    "position": "Customer Success Manager",
    "recommendation": "He has always been action-oriented and tackled problems head-on and gets things done, which kept complex projects running smoothly. He can handle challenging client interactions, stays cool under pressure, which really helps build trust with customers. On top of that, Laurens is a great collaborator, he creates a positive vibe in the team, always ready to share ideas and listen to others. I’m really glad I got to work with him, great colleague and fun person to be around."
  },
  {
    "name": "Terence",
    "position": "Customer Success Engineer",
    "recommendation": "Laurens possesses the ability to translate complex business requirements into technical concepts for both technical and non-technical audiences. His dedication to mentorship and knowledge sharing created a positive and collaborative working environment."
  }
]
